app/controllers/answers_controller.rb

INSERT INTO "answers" ("created_at", "updated_at", "enhancer_score", "transmuter_score", "emitter_score", "conjurer_score", "manipulator_score", "specialist_score") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        Answer.create(enhancer_score: 0, transmuter_score: 0, emitter_score: 0, conjurer_score: 0, manipulator_score: 0, specialist_score: 0)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" ORDER BY "answers"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def edit
        @question = Question.find(params[:id])
        @answer = Answer.last

SELECT "answers".* FROM "answers" ORDER BY "answers"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "answers" SET "updated_at" = ?, "transmuter_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-02 13:32:59.004173"], ["transmuter_score", 80], ["id", 73]]
UPDATE "answers" SET "updated_at" = ?, "transmuter_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-02 13:06:47.677143"], ["transmuter_score", 80], ["id", 60]]
UPDATE "answers" SET "updated_at" = ?, "conjurer_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-02 13:32:59.024258"], ["conjurer_score", 60], ["id", 73]]
UPDATE "answers" SET "updated_at" = ?, "manipulator_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-02 13:32:59.047470"], ["manipulator_score", 60], ["id", 73]]
UPDATE "answers" SET "updated_at" = ?, "enhancer_score" = ?, "transmuter_score" = ?, "emitter_score" = ?, "conjurer_score" = ?, "manipulator_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-06 13:37:04.673248"], ["enhancer_score", 100], ["transmuter_score", 80], ["emitter_score", 80], ["conjurer_score", 60], ["manipulator_score", 60], ["id", 80]]
UPDATE "answers" SET "updated_at" = ?, "specialist_score" = ? WHERE "answers"."id" = ?  [["updated_at", "2021-07-11 03:17:14.883810"], ["specialist_score", 500], ["id", 4]]
---
    def update
        @answer = Answer.last
        @question = Question.find(params[:id])

        @answer.update(enhancer_score: @answer.enhancer_score + @question.enhancer)
        @answer.update(transmuter_score: @answer.transmuter_score + @question.transmuter)
        @answer.update(emitter_score: @answer.emitter_score + @question.emitter)
        @answer.update(conjurer_score: @answer.conjurer_score + @question.conjurer)
        @answer.update(manipulator_score: @answer.manipulator_score + @question.manipulator)
        @answer.update(specialist_score: @answer.specialist_score + @question.specialist)

SELECT "answers"."enhancer_score", "answers"."transmuter_score", "answers"."emitter_score", "answers"."conjurer_score", "answers"."manipulator_score", "answers"."specialist_score" FROM "answers" ORDER BY "answers"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        last_answer = Answer.pluck(:enhancer_score, :transmuter_score, :emitter_score, :conjurer_score, :manipulator_score, :specialist_score).last
        keys = ["enhancer_score", "transmuter_score", "emitter_score", "conjurer_score", "manipulator_score", "specialist_score"]
        ary = [keys, last_answer].transpose
        hash_answer = Hash[*ary.flatten]
        max_answer = hash_answer.max{ |x,y| x[1] <=> y[1] }

        if max_answer[0] == "enhancer_score"
            @question = Question.find(1)
        elsif max_answer[0] == "transumuter_score"
            @question = Question.find(2)
        elsif max_answer[0] == "emitter_score"
            @question = Question.find(3)
        elsif max_answer[0] == "conjurer_score"
            @question = Question.find(4)
        elsif max_answer[0] == "manipulator_score"
            @question = Question.find(5)
        else max_answer[0] == "specialist_score"
            @question = Question.find(6)