app/controllers/questions_controller.rb

    def new
        @question = Question.find(1)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]