app/models/answer.rb

    def next
        Question.where("id > ?", self.id).order("id ASC").first
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]