app/models/question.rb

    def next
        Question.where("id > ?", self.id).order("id ASC").first
---
SELECT "questions".* FROM "questions" WHERE (id > 1) ORDER BY id ASC LIMIT ?  [["LIMIT", 1]]